; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	infrared3 - mode
	thermograph2 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 120)
	(= (data Phenomenon3 thermograph0) 30)
	(= (data Planet4 thermograph0) 241)
	(= (data Star5 thermograph0) 59)
	(= (data Phenomenon6 thermograph0) 79)
	(= (data Star7 thermograph0) 278)
	(= (data Phenomenon3 infrared3) 54)
	(= (data Planet4 infrared3) 54)
	(= (data Star5 infrared3) 69)
	(= (data Phenomenon6 infrared3) 227)
	(= (data Star7 infrared3) 76)
	(= (data Phenomenon3 thermograph2) 11)
	(= (data Planet4 thermograph2) 44)
	(= (data Star5 thermograph2) 78)
	(= (data Phenomenon6 thermograph2) 209)
	(= (data Star7 thermograph2) 278)
	(= (data Phenomenon3 thermograph1) 15)
	(= (data Planet4 thermograph1) 203)
	(= (data Star5 thermograph1) 109)
	(= (data Phenomenon6 thermograph1) 103)
	(= (data Star7 thermograph1) 15)
	(= (slew_time GroundStation2 GroundStation0) 2.203)
	(= (slew_time GroundStation0 GroundStation2) 2.203)
	(= (slew_time GroundStation2 Star1) 24.2)
	(= (slew_time Star1 GroundStation2) 24.2)
	(= (slew_time Star1 GroundStation0) 2.09)
	(= (slew_time GroundStation0 Star1) 2.09)
	(= (slew_time Phenomenon3 GroundStation0) 8.495)
	(= (slew_time GroundStation0 Phenomenon3) 8.495)
	(= (slew_time Phenomenon3 Star1) 0.6749)
	(= (slew_time Star1 Phenomenon3) 0.6749)
	(= (slew_time Phenomenon3 GroundStation2) 71.65)
	(= (slew_time GroundStation2 Phenomenon3) 71.65)
	(= (slew_time Planet4 GroundStation0) 86.13)
	(= (slew_time GroundStation0 Planet4) 86.13)
	(= (slew_time Planet4 Star1) 43.26)
	(= (slew_time Star1 Planet4) 43.26)
	(= (slew_time Planet4 GroundStation2) 3.741)
	(= (slew_time GroundStation2 Planet4) 3.741)
	(= (slew_time Planet4 Phenomenon3) 17)
	(= (slew_time Phenomenon3 Planet4) 17)
	(= (slew_time Star5 GroundStation0) 32.51)
	(= (slew_time GroundStation0 Star5) 32.51)
	(= (slew_time Star5 Star1) 40.16)
	(= (slew_time Star1 Star5) 40.16)
	(= (slew_time Star5 GroundStation2) 6.636)
	(= (slew_time GroundStation2 Star5) 6.636)
	(= (slew_time Star5 Phenomenon3) 9.993)
	(= (slew_time Phenomenon3 Star5) 9.993)
	(= (slew_time Star5 Planet4) 51.63)
	(= (slew_time Planet4 Star5) 51.63)
	(= (slew_time Phenomenon6 GroundStation0) 58.51)
	(= (slew_time GroundStation0 Phenomenon6) 58.51)
	(= (slew_time Phenomenon6 Star1) 4.423)
	(= (slew_time Star1 Phenomenon6) 4.423)
	(= (slew_time Phenomenon6 GroundStation2) 44.43)
	(= (slew_time GroundStation2 Phenomenon6) 44.43)
	(= (slew_time Phenomenon6 Phenomenon3) 9.571)
	(= (slew_time Phenomenon3 Phenomenon6) 9.571)
	(= (slew_time Phenomenon6 Planet4) 56.07)
	(= (slew_time Planet4 Phenomenon6) 56.07)
	(= (slew_time Phenomenon6 Star5) 26.39)
	(= (slew_time Star5 Phenomenon6) 26.39)
	(= (slew_time Star7 GroundStation0) 32.58)
	(= (slew_time GroundStation0 Star7) 32.58)
	(= (slew_time Star7 Star1) 5.113)
	(= (slew_time Star1 Star7) 5.113)
	(= (slew_time Star7 GroundStation2) 2.502)
	(= (slew_time GroundStation2 Star7) 2.502)
	(= (slew_time Star7 Phenomenon3) 51.13)
	(= (slew_time Phenomenon3 Star7) 51.13)
	(= (slew_time Star7 Planet4) 39.58)
	(= (slew_time Planet4 Star7) 39.58)
	(= (slew_time Star7 Star5) 74.4)
	(= (slew_time Star5 Star7) 74.4)
	(= (slew_time Star7 Phenomenon6) 58.74)
	(= (slew_time Phenomenon6 Star7) 58.74)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon3 thermograph2)
	(have_image Star5 thermograph1)
	(have_image Star7 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 120 to 114.887, (fuel-used) from 0 to 5.113
   goals met: 0 of 3
2. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 114.887 to 112.385, (fuel-used) from 5.113 to 7.615
   goals met: 0 of 3
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 112.385 to 109.883, (fuel-used) from 7.615 to 10.117
   goals met: 0 of 3
5. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 109.883 to 107.381, (fuel-used) from 10.117 to 12.619
   goals met: 0 of 3
6. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 3
7. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 107.381 to 105.178, (fuel-used) from 12.619 to 14.822
   goals met: 0 of 3
8. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 105.178 to 102.975, (fuel-used) from 14.822 to 17.025
   goals met: 0 of 3
9. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 102.975 to 100.772, (fuel-used) from 17.025 to 19.228
   goals met: 0 of 3
10. (turn_to satellite0 star1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 100.772 to 98.682, (fuel-used) from 19.228 to 21.318
   goals met: 0 of 3
11. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 98.682 to 93.569, (fuel-used) from 21.318 to 26.431
   goals met: 0 of 3
12. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 93.569 to 91.067, (fuel-used) from 26.431 to 28.933
   goals met: 0 of 3
13. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 91.067 to 88.864, (fuel-used) from 28.933 to 31.136
   goals met: 0 of 3
14. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 88.864 to 86.661, (fuel-used) from 31.136 to 33.339
   goals met: 0 of 3
15. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 86.661 to 84.458, (fuel-used) from 33.339 to 35.542
   goals met: 0 of 3
16. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 84.458 to 82.255, (fuel-used) from 35.542 to 37.745
   goals met: 0 of 3
17. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 82.255 to 80.052, (fuel-used) from 37.745 to 39.948
   goals met: 0 of 3
18. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 80.052 to 77.849, (fuel-used) from 39.948 to 42.151
   goals met: 0 of 3
19. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 77.849 to 75.646, (fuel-used) from 42.151 to 44.354
   goals met: 0 of 3
20. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 75.646 to 73.443, (fuel-used) from 44.354 to 46.557
   goals met: 0 of 3
21. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 73.443 to 71.24, (fuel-used) from 46.557 to 48.76
   goals met: 0 of 3
22. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 71.24 to 69.037, (fuel-used) from 48.76 to 50.963
   goals met: 0 of 3
23. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 69.037 to 66.834, (fuel-used) from 50.963 to 53.166
   goals met: 0 of 3
24. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 66.834 to 64.631, (fuel-used) from 53.166 to 55.369
   goals met: 0 of 3
25. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 64.631 to 62.428, (fuel-used) from 55.369 to 57.572
   goals met: 0 of 3
26. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 62.428 to 60.225, (fuel-used) from 57.572 to 59.775
   goals met: 0 of 3
27. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 60.225 to 58.022, (fuel-used) from 59.775 to 61.978
   goals met: 0 of 3
28. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 58.022 to 55.819, (fuel-used) from 61.978 to 64.181
   goals met: 0 of 3
29. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 55.819 to 53.616, (fuel-used) from 64.181 to 66.384
   goals met: 0 of 3
30. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 53.616 to 51.413, (fuel-used) from 66.384 to 68.587
   goals met: 0 of 3
31. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 51.413 to 48.911, (fuel-used) from 68.587 to 71.089
   goals met: 0 of 3
32. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 48.911 to 46.409, (fuel-used) from 71.089 to 73.591
   goals met: 0 of 3
33. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 46.409 to 43.907, (fuel-used) from 73.591 to 76.093
   goals met: 0 of 3
34. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 43.907 to 41.405, (fuel-used) from 76.093 to 78.595
   goals met: 0 of 3
35. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
36. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 41.405 to 39.202, (fuel-used) from 78.595 to 80.798
   goals met: 0 of 3
37. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 39.202 to 36.999, (fuel-used) from 80.798 to 83.001
   goals met: 0 of 3
38. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 36.999 to 34.796, (fuel-used) from 83.001 to 85.204
   goals met: 0 of 3
39. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 34.796 to 32.593, (fuel-used) from 85.204 to 87.407
   goals met: 0 of 3
40. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 32.593 to 30.39, (fuel-used) from 87.407 to 89.61
   goals met: 0 of 3
41. (turn_to satellite0 star1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 30.39 to 28.3, (fuel-used) from 89.61 to 91.7
   goals met: 0 of 3
42. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 3
43. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 28.3 to 23.187, (fuel-used) from 91.7 to 96.813
   goals met: 0 of 3
44. (take_image satellite0 star7 instrument1 thermograph1)
   added: (have_image star7 thermograph1)
   changed: (data_capacity satellite0) from 1000 to 985, (data-stored) from 0 to 15
   goals met: 1 of 3
45. (turn_to satellite0 star1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 23.187 to 18.074, (fuel-used) from 96.813 to 101.926
   goals met: 1 of 3
46. (turn_to satellite0 phenomenon3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 18.074 to 17.3991, (fuel-used) from 101.926 to 102.601
   goals met: 1 of 3
47. (take_image satellite0 phenomenon3 instrument1 thermograph2)
   added: (have_image phenomenon3 thermograph2)
   changed: (data_capacity satellite0) from 985 to 974, (data-stored) from 15 to 26
   goals met: 2 of 3
48. (turn_to satellite0 star5 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 17.3991 to 7.4061, (fuel-used) from 102.601 to 112.594
   goals met: 2 of 3
49. (take_image satellite0 star5 instrument1 thermograph1)
   added: (have_image star5 thermograph1)
   changed: (data_capacity satellite0) from 974 to 865, (data-stored) from 26 to 135
   goals met: 3 of 3
